pastgriot/CursoRTOSARM/STM32_FreeRTOS_Queue_Procesing/src/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  Ac6
  * @version V1.0
  * @date    01-December-2013
  * @brief   Default main function.
  ******************************************************************************
*/


#include <stdio.h>
#include <stdint.h>
#include <string.h>

#include "stm32f30x.h"
#include "stm32f3_discovery.h"
#include "FreeRTOS.h"
#include "task.h"



//MACROS varias

#define FALSE 0
#define TRUE 1
#define NOT_PRESSED FALSE
#define PRESSED TRUE

//task function prototypes
void led_task_handler(void *params);
void button_task_handler(void *params);


//normal function prototypes
static void prvSetupHardware(void);
static void prvSetupUART(void);
static void prvSetupGPIO(void);
void printmsg(char *msg);
//void button_handler(void);
void rtos_delay(uint32_t delay_in_ms );

//variables globales
uint8_t button_status_flag = NOT_PRESSED;
char usr_msg[250];

TaskHandle_t xTaskHandle1 = NULL;
TaskHandle_t xTaskHandle2 = NULL;

int main(void)
{


	//1. resetea la configuracion RCC al estado de reset default
	//HSI On, PLL off, HSE off, system Clock = 8MHz, CPU Clock = 8  MHz
	RCC_DeInit();

	//2. actualiza la variable SystemCoreClock
	SystemCoreClockUpdate();

	prvSetupHardware();


	//3. Creacion de 2 task, task-1 y task-2
	xTaskCreate(led_task_handler,"LED-TASK", 500, NULL,
			2, &xTaskHandle1 );

	xTaskCreate(button_task_handler,"BUTTON-TASK", 500, NULL,
			2, &xTaskHandle2 );


	//.4 Inicio el scheduler RTOS
	vTaskStartScheduler();

	for(;;);
}



void led_task_handler(void *params)
{
	uint32_t current_notif_value = 0;
	while(1)
	{

		//espero hasta recibir el eventi de  notificacionn desde button task
		if(xTaskNotifyWait(0,0,&current_notif_value,portMAX_DELAY) == pdTRUE)
		{
			sprintf(usr_msg, "La Notificacion ha sido recibida : Conteo de boton presionado: %ld \r\n", current_notif_value );
			printmsg(usr_msg);

			//a falta de toggle..
			GPIO_WriteBit(GPIOE,GPIO_Pin_9, button_status_flag ^=1);

		}
	}
}


void button_task_handler(void *params){
	while(1)
	{
		//lee el botón
		if (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_0))
		{
			//rtos_delay de 100ms
			rtos_delay(100);

			//Se envia la notificación al task led
			xTaskNotify(xTaskHandle1,0x00, eIncrement);
		}
	}
}

static void prvSetupHardware(void){

	//Setup GPIO
	prvSetupGPIO();

	//Setup UART1
	prvSetupUART();


}

static void prvSetupUART(void){

	GPIO_InitTypeDef gpio_uart_pins;
	USART_InitTypeDef uart2_init;

	//1. Habilitar UART Peripheral Clock y PortC Peripheral Clock
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2,ENABLE);
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);

	//2. Configuro pines como UART  Rx = PA3 y Tx = PA2

	gpio_uart_pins.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3;
	gpio_uart_pins.GPIO_Mode = GPIO_Mode_AF;
	gpio_uart_pins.GPIO_PuPd = GPIO_PuPd_UP;

	GPIO_Init(GPIOA, &gpio_uart_pins);

	//3. Configuro Alt. function para USART2 en Pin 4 y Pin 5
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_7);
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_7);

	//4. Inicialización USART2

	//limpio las estructuras por si hay basura
	memset(&uart2_init,0,sizeof(uart2_init));
	uart2_init.USART_BaudRate = 115200;
	uart2_init.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	uart2_init.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
	uart2_init.USART_Parity = USART_Parity_No;
	uart2_init.USART_StopBits = USART_StopBits_1;
	uart2_init.USART_WordLength = USART_WordLength_8b;

	//5. Enable USART2 periph

	USART_Init(USART2, &uart2_init);
	USART_Cmd(USART2, ENABLE);
}


static void prvSetupGPIO(void){

	//board specific
	GPIO_InitTypeDef led_init, button_init;

	//1. Habilitar PortA (boton) Peripheral Clock

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOE, ENABLE);


	//2. Configuro e inicio LED pin 9 gpio E como salida pushpull, slow speed
	led_init.GPIO_Mode = GPIO_Mode_OUT;
	led_init.GPIO_OType = GPIO_OType_PP;
	led_init.GPIO_Pin = GPIO_Pin_9 ;  //LED 3
	led_init.GPIO_Speed = GPIO_Speed_50MHz;
	led_init.GPIO_PuPd = GPIO_PuPd_NOPULL;

	GPIO_Init(GPIOE, &led_init);

	//3. habilito PortE (led) Peripheral Clock y APB2 reloj para SYSCFG (interrupción del pín)
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

	//4. Configuro e inicio botton pin 0 gpio A como Entrada

	button_init.GPIO_Mode = GPIO_Mode_IN;
	button_init.GPIO_Pin = GPIO_Pin_0 ;  //button_0
	button_init.GPIO_Speed = GPIO_Speed_50MHz;
	button_init.GPIO_PuPd = GPIO_PuPd_NOPULL;

	GPIO_Init(GPIOA, &button_init);

	//5. Interrupcion config para boton PA0

    // Connect Button EXTI Line to Button GPIO Pin
    SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA, EXTI_PinSource0);

    EXTI_InitTypeDef EXTI_InitStructure;

    // Configure Button EXTI line
    EXTI_InitStructure.EXTI_Line = EXTI_Line0;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);

    //6. Configuracion NVIC
    NVIC_SetPriority(EXTI0_IRQn,5);
    NVIC_EnableIRQ(EXTI0_IRQn);
}

void printmsg(char *msg){

	for (uint32_t i = 0;i < strlen(msg);i++){
		while (USART_GetFlagStatus(USART2,USART_FLAG_TXE) != SET);
		USART_SendData(USART2, msg[i]);
	}
}

void EXTI0_IRQHandler(void)
{
	traceISR_ENTER();
	//1. limpia el pending bit of EXTI line (0)
	EXTI_ClearITPendingBit(EXTI_Line0);
	//button_handler();
	traceISR_EXIT();
}

void rtos_delay(uint32_t delay_in_ms)
{
	uint32_t current_tick_count = xTaskGetTickCount();
	uint32_t delay_int_ticks = (delay_in_ms * configTICK_RATE_HZ)/1000;

	while(xTaskGetTickCount() < (current_tick_count + delay_int_ticks));

}
